Revit 2026 API

# ExternalResourceReference(ExternalResourceReference) Constructor

---

Creates a new ExternalResourceReference from the given ExternalResourceReference.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExternalResourceReference(
	ExternalResourceReference other
)
```
```vb
Public Sub New (
	other As ExternalResourceReference
)
```
```cpp
public:
ExternalResourceReference(
	ExternalResourceReference^ other
)
```
```fsharp
new :
        other : ExternalResourceReference -> ExternalResourceReference
```

#### Parameters

other ExternalResourceReference
     The ExternalResourceReference to copy.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExternalResourceReference Class

ExternalResourceReference Overload

Autodesk.Revit.DB Namespace